import { serviceState, testimonialsState, PriceVariableState } from "./dataTypes";

export const contact = {
  whatsapp: "https://wa.me/996708242906",
  telegram: "https://t.me/+996708242906",
  instagram: "https://www.instagram.com/_kvadrat_kg?igsh=MXYzdjd1M2d6OHc4ZQ%3D%3D&utm_source=qr",
  youtube: "https://youtube.com/@Tunduk312",
};

export const services: serviceState[] = [
  {
    id: 1,
    image: "/svg/chekcbox.svg",
    description: "Продать недвижимость",
  },
  {
    id: 2,
    image: "/svg/hi.svg",
    description: "Срочный выкуп недвижимости",
  },

  {
    id: 3,
    image: "/svg/monay.svg",
    description: "Инвестиции в недвижимость",
  },
  {
    id: 4,
    image: "/svg/ava.svg",
    description: "Юридическое сопровождение",
  },
];

export const testimonials: testimonialsState[] = [
  {
    id: 1,
    name: "Айбек Жээнмырзаев",
    text: "Салам алейкум агенствонун балдарына чоон рахмат .Тез убакыт ичинде менин батиримди сатып беришти.",
  },
  {
    id: 2,
    name: "Чооров Эламан ",
    text: "Балдарга рахмат шаар чекесиндеги участогумду 5кундо сатып беришти абдан ыраазымын.",
  },
  {
    id: 3,
    name: "Алтынай Керимбекова",
    text: "Спасибо команде Квадрат 312 быстро нашли мне квартиру под ипотеку .",
  },
  {
    id: 4,
    name: "Сталбеков Мадияр ",
    text: "Рахмат балдарга уйубузду 3жумада жакшы баага сатып беришти чоон рахмат.",
  },
  {
    id: 5,
    name: "Урматбекова Айназик",
    text: "Спасибо ребятам за профессионализм За 3 дня нашли квартиру мечты я очень рада.",
  },
  {
    id: 6,
    name: "Сталбеков Мадияр ",
    text: "Рахмат балдарга уйубузду 3жумада жакшы баага сатып беришти чоон рахмат.",
  },
  {
    id: 7,
    name: "Миргуль Торторбаева",
    text: "Азамат балдар экен уйумду баш оорусуз саттым. Буйруса келечекте дагы коп кайрылам.",
  },
  {
    id: 8,
    name: "Касымбекова Индира",
    text: "Базарда иштеп эч эле убактым жок эле уй сатканы .Балдарга уйумдун ачкычын бердим мен жок эле клиент табып жакшы баада сатышты чоон рахмат Аллах ыраазы болсун.",
  },
  {
    id: 9,
    name: "Батыркулов Урмат",
    text: "Салам Военантоновкадагы участогумду бат эле сатып беришти .Оформленияда жардам беришти азыр справка аны мунусу коп экен .Силерге чоон рахмат .Жакын туугандарыма дагы совет берем силерди.",
  },
];

export const priceVariable: PriceVariableState[] = [
  { id: 0, label: "Без ограничения", min: null, max: null },
  { id: 1, label: "до 1млн", min: 0, max: 1_000_000 },
  { id: 2, label: "от 1млн до 2млн", min: 1_000_000, max: 2_000_000 },
  { id: 3, label: "от 2млн до 3млн", min: 2_000_000, max: 3_000_000 },
  { id: 4, label: "от 3млн до 4млн", min: 3_000_000, max: 4_000_000 },
  { id: 5, label: "от 4млн до 5млн", min: 4_000_000, max: 5_000_000 },
  { id: 6, label: "от 5млн", min: 5_000_000, max: null },
];

export const addressArray: string[] = [
  "Микрорайоны",
  "Золотой квадрат",
  "Район политех",
  "Ак-кеме (старый аэропорт)",
  "Ак-Ордо (1,2,3)",
  "Ак-Орго",
  "Арча-бешик",
  "Асанбай",
  "БГУ",
  "Гоин",
  "Гор.Гаи",
  "Западный новый автовокзал",
  "Интергельпо",
  "Карагачева роща",
  "Киргизия-1",
  "Кирком",
  "Кок-жар",
  "Пишпек",
  "Рабочий городок",
  "Старый толчок",
  "Нижняя Алa-арча",
  "Маевка",
  "Красный строитель",
  "Алматинка/Объездная",
  "Аэропорт",
  "Фучика",
  "Район панорамы",
  "Парк Ататюрк",
  "Восток-5",
  "Дордой рынок",
  "Алтын ордо (полицейский городок)",
  "Рынок ортосай",
  "Район Ауэзова",
  "Резиденция",
  "Бишкек",
  "Аламедин (ГЭС 2)",
  "Байтик",
  "Беш кунгей",
  "Военноантоновка",
  "Джал мкрн",
  "Заря",
  "Кашка суу",
  "Кой таш",
  "Кунтуу",
  "Кызыл туу",
  "Лебединовка",
  "Новопавловка",
  "Новопокровка",
  "Селекционная",
];
